_Rarzrabotki/Kazna/Documents/РаспределениеФ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РаспределениеФ2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиратьТабельПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьНаправлениеПоТабелю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ДанныеТабелирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДанныеТабелирования</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыОфициальные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисленияНаЗарплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУдержанияСЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоКарточке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/РаспределениеФ2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	Если Элементы.Сотрудники.ТекущаяСтрока=Неопределено Тогда
		
	Иначе	
		Элементы.Распределение.ОтборСтрок=Новый ФиксированнаяСтруктура("Сотрудник",Элементы.Сотрудники.ТекущиеДанные.Сотрудник);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Если Элементы.Сотрудники.ТекущаяСтрока=Неопределено Тогда
		
	Иначе	
		Элементы.Распределение.ОтборСтрок=Новый ФиксированнаяСтруктура("Сотрудник",Элементы.Сотрудники.ТекущиеДанные.Сотрудник);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Распределение.ТекущиеДанные.Сотрудник= Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБухгалтерииНаСервере()
	V8=Новый COMОбъект("V83.COMConnector");
	Сервер="1csql";
	БазаДанных="kompas_upr";
	
	//СтрПодключения="File="""+СокрЛП(ПутьКБазе)+""";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ321""";
	//СтрПодключения="srvr='" + Сервер + "'; ref='" + БазаДанных +""";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ321""";
	//Srvr="localhost";Ref="upp_ac";
	//Если Объект.Организация.Код="000000088" Тогда
	//	СтрПодключения="srvr=""sql"";ref=""bu_trans"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	//ИначеЕсли Объект.Организация.Код="000000087" Тогда
	//	СтрПодключения="srvr=""sql"";ref=""bu_stil"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";	
	//Иначе
	//	СтрПодключения="srvr=""sql"";ref=""gp"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	//КонецЕсли;
	
	СтрПодключения="srvr=""localhost"";ref=""zup"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	
	//Сообщить(СтрПодключения);
	Попытка   
		БазаПР=V8.Connect(СтрПодключения);
	Исключение
		сообщить(ОписаниеОшибки());
		
		Сообщить("Ошибка при подключении!");
		ЕстьПодключение = Ложь;
	КонецПопытки;
	
	ЕстьПодключение= Истина;
	
	
	ЗапросБУ=  БазаПР.NewObject("Запрос");
	ЗапросБУ.Текст =  "
	|ВЫБРАТЬ
	|	Начисления.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(Начисления.Результат) КАК СуммаНачислено,
	|	0 КАК СуммаФОТ,
	|	0 КАК СуммаНалогов,
	|	Начисления.Сотрудник.Физлицо.Наименование
	|ПОМЕСТИТЬ ОбщаяТЗ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
	|	И Начисления.ВидРасчета.Код <> ""00021""
	|	И Начисления.Результат <> 0
	|	И Начисления.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник.Физлицо.КодПоДРФО,
	|	Начисления.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Результат),
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	РегистрРасчета.ВзносыВФонды КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ВзносыВФондыИНалоги.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
	|	И ВзносыВФондыИНалоги.Результат <> 0
	|	И ВзносыВФондыИНалоги.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.НалогПриход),
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоНДФЛ.Обороты(&ПериодРегистрации, &КонПериода, , ) КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.НалогПриход <> 0
	|	И ВзносыВФондыИНалоги.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(ВзносыВФондыИНалоги.Сумма),
	|	0,
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Сумма <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(ВзносыВФондыИНалоги.Налог),
	|	0,
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Налог <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Налог),
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Налог <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Результат),
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Результат <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяТЗ.СотрудникФизлицоКодПоДРФО,
	|	СУММА(ОбщаяТЗ.СуммаНачислено) КАК СуммаНачисления,
	|	СУММА(ОбщаяТЗ.СуммаФОТ) КАК СуммаФОТ,
	|	СУММА(ОбщаяТЗ.СуммаНалогов) КАК СуммаНалогов,
	|	ОбщаяТЗ.СотрудникФизлицоНаименование
	|ИЗ
	|	ОбщаяТЗ КАК ОбщаяТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТЗ.СотрудникФизлицоКодПоДРФО,
	|	ОбщаяТЗ.СотрудникФизлицоНаименование"; 
	
	ЗапросБУ.УстановитьПараметр("Код",Объект.Организация.Код);
	ЗапросБУ.УстановитьПараметр("ПериодРегистрации",НачалоМесяца(Объект.Дата));
	ЗапросБУ.УстановитьПараметр("КонПериода",КонецДня(КонецМесяца(Объект.Дата)));
	
	//ЗапросБУ.УстановитьПараметр("УчитыватьАванс",?(КонецМесяца(Объект.Дата)=КонецМесяца(ТекущаяДата()),Истина,ЛОЖЬ));
	ЗапросБУ.УстановитьПараметр("УчитыватьАванс",Объект.УчитыватьАванс);
	Выборка = ЗапросБУ.Выполнить().Выбрать();
	
	Объект.Сотрудники.Очистить();
	Объект.Распределение.Очистить();
	//Объект.Распределение.Очистить();
	Пока Выборка.Следующий() Цикл
		//Сообщить(""+Выборка.СотрудникФизлицоНаименование+"  "+Выборка.СуммаНачислено);
		нСотр= Справочники.Сотрудники.НайтиПоРеквизиту("Инн",Выборка.СотрудникФизлицоКодПоДРФО);
		Если нСотр.Пустая() Тогда
			Сообщить("Не найден сотрудник "+Выборка.СотрудникФизлицоНаименование+", ИНН  "+Выборка.СотрудникФизлицоКодПоДРФО);
		КонецЕсли;
		
		нСТр  =  Объект.Сотрудники.Добавить();
		нСТр.Сотрудник=нСотр;
		нСтр.СуммаНачисления= Число( Строка(Выборка.СуммаНачисления));
		нСтр.СуммаФОТ= Число( Строка(Выборка.СуммаФОТ));
		нСтр.СуммаНалогов= Число( Строка(Выборка.СуммаНалогов));
	КонецЦикла;
	
	
	
	//Исключения, выллаты через кассу
	ЗапросБУ=  БазаПР.NewObject("Запрос");
	ЗапросБУ.Текст =  "
	|ВЫБРАТЬ
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник,
	|	СУММА(ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов) КАК Сумма,
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник.Наименование
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	|ГДЕ
	|	ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &НачПериода И &КонПериода
	|	И ВзаиморасчетыСРаботникамиОрганизаций.Организация.Код = &Код
	|	И ВзаиморасчетыСРаботникамиОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезКассу)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник	";

	
	//ЗапросБУ.УстановитьПараметр("НачДАта",НачалоМесяца(Объект.Дата)+60*60*24);
	//ЗапросБУ.УстановитьПараметр("КОнДАта",КонецДня(КонецМесяца(Объект.Дата))+60*60*24);
	
	ЗапросБУ.УстановитьПараметр("Код",Объект.Организация.Код);
	ЗапросБУ.УстановитьПараметр("НачПериода",Объект.КассаДатаС);
	ЗапросБУ.УстановитьПараметр("КонПериода",КонецДня(Объект.КассаДатаПо));
	
	
	Выборка = ЗапросБУ.Выполнить().Выбрать();
	
	Объект.СотрудникиИсключения.Очистить();
	Пока Выборка.Следующий() Цикл
		//Сообщить(""+Выборка.СотрудникФизлицоНаименование+"  "+Выборка.СуммаНачислено);       
		Если ЗначениеЗаполнено(Выборка.СотрудникФизлицоКодПоДРФО) Тогда
			нСотр= Справочники.Сотрудники.НайтиПоРеквизиту("Инн",Выборка.СотрудникФизлицоКодПоДРФО);	
		Иначе
			нСотр= Справочники.Сотрудники.НайтиПоНаименованию(Выборка.СотрудникФизлицоНаименование);	
		КонецЕсли;
		
		Если нСотр.Пустая() Тогда
			Сообщить("Не найден сотрудник "+Выборка.СотрудникФизлицоНаименование+", ИНН  "+Выборка.СотрудникФизлицоКодПоДРФО+?(Выборка.СотрудникФизлицоКодПоДРФО=""," *** ВНИМАНИЕ, не заполнен ИНН",""));
		КонецЕсли;
		
		нСТр  =  Объект.СотрудникиИсключения.Добавить();
		нСТр.Сотрудник=нСотр;
		нСТр.СуммаВыплаты=Число(Строка(Выборка.Сумма));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьExcelФайл(Команда)
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
    Диалог.Заголовок = "Выберите файл Excel";
    
    // Асинхронний виклик діалогу для тонкого клієнта
    Диалог.Показать(Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтотОбъект));
КонецПроцедуры

// Обробка вибору файлу (на клієнті)
&НаКлиенте
Процедура ОбработкаВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
        ПутьКФайлу = ВыбранныеФайлы[0];
        
        // Завантаження файлу в тимчасове сховище
        ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтотОбъект);
        НачатьПомещениеФайла(ОписаниеОповещения, , ПутьКФайлу, Ложь);
    Иначе
        Сообщить("Файл не выбран!");
    КонецЕсли;
КонецПроцедуры

// Після завантаження файлу в тимчасове сховище (на клієнті)
&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    Если Результат Тогда
        // Виклик серверної процедури для обробки файлу
        ПрочитатьExcelНаСервере(Адрес);
    Иначе
        Сообщить("Ошибка при загрузке файла!");
    КонецЕсли;
КонецПроцедуры

// Виконується на сервері
&НаСервере
Процедура ПрочитатьExcelНаСервере(Адрес)
    // Отримання файлу з тимчасового сховища
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
    
    // Збереження файлу на сервері у тимчасовий файл
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
    ДвоичныеДанные.Записать(ИмяВременногоФайла);
    
    // Створення та читання табличного документа
    ТабДок = Новый ТабличныйДокумент;
    Попытка
        ТабДок.Прочитать(ИмяВременногоФайла);
        Объект.Сотрудники.Очистить();
        // Обробка даних
		Для НомерСтроки = 6 По ТабДок.ВысотаТаблицы Цикл  
			Код = ТабДок.Область(НомерСтроки, 5, НомерСтроки, 5).Текст; 
			Если не значениезаполнено(Код) Тогда 
				Продолжить;
			КонецЕсли; 
			Сумма = ТабДок.Область(НомерСтроки, 18, НомерСтроки, 18).Текст;  
			
			нСотр= Справочники.Сотрудники.НайтиПоРеквизиту("Инн",Код);
			
			Если нСотр.Пустая() Тогда
				Сообщить("Не найден сотрудник, ИНН  "+Код);  
			ИначеЕсли ЗначениеЗаполнено(Сумма) Тогда  
				Нстрока = Объект.Сотрудники.Добавить();	
				Нстрока.Сотрудник  =  нСотр;
				Нстрока.СуммаНачисления = Сумма;
			КонецЕсли;
            					
		КонецЦикла;
        
        Сообщить("Файл успешно прочитан!");
        
        // Видалення тимчасового файлу
        УдалитьФайлы(ИмяВременногоФайла);
        
    Исключение
        УдалитьФайлы(ИмяВременногоФайла); // Видалення файлу в разі помилки
        Сообщить("Ошибка при чтении файла: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры





&НаСервере
Процедура ЗаполнитьТабЧасть()  
	//Для НомерСтроки = 6 По ТабДок.ВысотаТаблицы Цикл  
	//	Код = ТабДок.Область(НомерСтроки, 5, НомерСтроки, 5).Текст; 
	//			Если не значениезаполнено(Код) Тогда 
	//				Продолжить;
	//			КонецЕсли; 
	//	
	//	 Сумма = ТабДок.Область(НомерСтроки, 18, НомерСтроки, 18).Текст; 
	//	
	//КонецЦикла;
	
	
	//Для Каждого Область Из ТабДок.Области Цикл  
	//	Если СокрЛп(Область.Имя) = Имя Тогда 
	//	//Если СтрНачинаетсяС(Область.Имя, Имя) Тогда    
	//		
	//		МесяцГод = НазваниеМесяцаСГодом(Объект.Дата);
	//		
	//		КолонкаБезнал = Неопределено;
	//		Строка = Область.Верх + 2;
	//		Для НомерКолонки =2 По ТабДок.ШиринаСтраницы Цикл  
	//			Данные = ТабДок.Область(Строка, НомерКолонки, Строка, НомерКолонки).Текст; 
	//			Если МесяцГод =  Данные Тогда  
	//				КолонкаБезнал = НомерКолонки;
	//				Прервать;;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если КолонкаБезнал = Неопределено Тогда 
	//		 Сообщить("Не знайшли місяць, який відповідає даті документа!");
	//		Иначе
	//		Начало = Область.Верх+4;
	//		КоличествоСтрок = Область.Низ ;
	//		//КоличествоСтрок = Табдок.ВысотаТаблицы;  
	//		Н = 1; 
	//		КолонкаНал = КолонкаБезнал +1; 
	//		
	//		
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	//	|	СтатьиДвиженияДенежныхСредств.Наименование
	//	|ИЗ
	//	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	//	|ГДЕ
	//	|	НЕ СтатьиДвиженияДенежныхСредств.ЭтоГруппа
	//	|	И НЕ СтатьиДвиженияДенежныхСредств.Ссылка В ИЕРАРХИИ (&ГруппаНеУчитывать)";
	//
	//Запрос.УстановитьПараметр("ГруппаНеУчитывать", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-000965"));
	//Выборка =  Запрос.Выполнить().Выбрать();
	//СоответствиеСтатей = Новый Соответствие;
	//Пока Выборка.Следующий() Цикл
	//	СоответствиеСтатей.Вставить(Нрег(Выборка.Наименование),Выборка.Ссылка);
	//КонецЦикла;
	//	
	//		
	//		Для НомерСтроки = Начало По КоличествоСтрок Цикл
	//			
	//			Если ТабДок.Область(НомерСтроки, Н, НомерСтроки, Н).шрифт.Размер = 8 Тогда 
	//			Наименование = ТабДок.Область(НомерСтроки, Н, НомерСтроки, Н).Текст; 
	//			Если не значениезаполнено(Наименование) Тогда 
	//				Продолжить;
	//			КонецЕсли;  
	//			Попытка
	//				Безнал       = Число(ТабДок.Область(НомерСтроки, КолонкаБезнал, НомерСтроки, КолонкаБезнал).Текст);
	//			Исключение 
	//				Безнал = 0;
	//			КонецПопытки;    
	//			
	//			Попытка
	//				Нал          = Число(ТабДок.Область(НомерСтроки, КолонкаНал, НомерСтроки, КолонкаНал).Текст); 
	//			Исключение 
	//				Нал    = 0;
	//			КонецПопытки;
	//			
	//			Если Безнал>0 Или Нал>0 Тогда 
	//				Статья = СоответствиеСтатей.Получить(Нрег(Наименование));
	//				Если ЗначениеЗаполнено(Статья) Тогда    
	//					
	//					Если Безнал>0 Тогда  
	//						ДобавитьСтрокуВТЧ(Статья,Безнал,Истина);
	//					КонецЕсли;
	//					
	//					Если Нал>0 Тогда  
	//						ДобавитьСтрокуВТЧ(Статья,Нал,Ложь);
	//					КонецЕсли;
	//					
	//				Иначе
	//					Сообщить("Не нашли статью " + Наименование);
	//				КонецЕсли;
	//			КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//	    КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры    


&НаСервере
Процедура РаспределитьНаСервере()
	Запрос = Новый Запрос;
	
	Запрос.Текст=    "ВЫБРАТЬ
	                 |	РаспределениеФ2.Сотрудник КАК Сотрудник,
	                 |	ВЫБОР
	                 |		КОГДА &ОпределятьНаправлениеПоТабелю
	                 |				И НЕ РаспределениеФ2.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА ЕСТЬNULL(ДанныеТабелированияОбороты.Направление, РаспределениеФ2.Сотрудник.ОсновноеНаправление)
	                 |		ИНАЧЕ РаспределениеФ2.Сотрудник.ОсновноеНаправление
	                 |	КОНЕЦ КАК Направление,
	                 |	ВЫБОР
	                 |		КОГДА РаспределениеФ2.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА РаспределениеФ2.Сотрудник.ОсновноеПодразделение
	                 |		ИНАЧЕ ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, ВЫБОР
	                 |					КОГДА РаспределениеФ2.Сотрудник.ОсновноеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	                 |						ТОГДА РаспределениеФ2.Сотрудник.Родитель.ОсновноеПодразделение
	                 |					ИНАЧЕ РаспределениеФ2.Сотрудник.ОсновноеПодразделение
	                 |				КОНЕЦ)
	                 |	КОНЕЦ КАК Подразделение,
	                 |	ЕСТЬNULL(СУММА(ДанныеТабелированияОбороты.ЧасыФактОборот), 0) КАК ОтработаноЧасов
	                 |ИЗ
	                 |	Документ.РаспределениеФ2.Сотрудники КАК РаспределениеФ2
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеТабелирования.Обороты(&НачПериода, &КонПериода, Регистратор, {(Организация = &Организация) КАК Поле2}) КАК ДанныеТабелированияОбороты
	                 |		ПО РаспределениеФ2.Сотрудник = ДанныеТабелированияОбороты.Сотрудник
	                 |			И (ДанныеТабелированияОбороты.Состояние В (&СпСостояний))
	                 |			И (НЕ ДанныеТабелированияОбороты.Регистратор.НеРаспределять)
	                 |ГДЕ
	                 |	РаспределениеФ2.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ДанныеТабелированияОбороты.Сотрудник,
	                 |	ДанныеТабелированияОбороты.Подразделение,
	                 |	РаспределениеФ2.Сотрудник,
	                 |	ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, РаспределениеФ2.Сотрудник.ОсновноеПодразделение),
	                 |	ВЫБОР
	                 |		КОГДА &ОпределятьНаправлениеПоТабелю
	                 |				И НЕ РаспределениеФ2.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА ЕСТЬNULL(ДанныеТабелированияОбороты.Направление, РаспределениеФ2.Сотрудник.ОсновноеНаправление)
	                 |		ИНАЧЕ РаспределениеФ2.Сотрудник.ОсновноеНаправление
	                 |	КОНЕЦ,
	                 |	ВЫБОР
	                 |		КОГДА РаспределениеФ2.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА РаспределениеФ2.Сотрудник.ОсновноеПодразделение
	                 |		ИНАЧЕ ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, ВЫБОР
	                 |					КОГДА РаспределениеФ2.Сотрудник.ОсновноеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	                 |						ТОГДА РаспределениеФ2.Сотрудник.Родитель.ОсновноеПодразделение
	                 |					ИНАЧЕ РаспределениеФ2.Сотрудник.ОсновноеПодразделение
	                 |				КОНЕЦ)
	                 |	КОНЕЦ
	                 |ИТОГИ
	                 |	СУММА(ОтработаноЧасов)
	                 |ПО
	                 |	Сотрудник"    ;
	СпСостояний=Новый СписокЗначений();
	СпСостояний.Добавить("Р");
	ЗАпрос.УстановитьПараметр("СпСостояний",СпСостояний);
	ЗАпрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	СпСотрудников = Новый СписокЗначений;
	Для каждого Стр Из Объект.Сотрудники Цикл
		СпСотрудников.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	
	Запрос.УстановитьПараметр("ОпределятьНаправлениеПоТабелю",Объект.ОпределятьНаправлениеПоТабелю);
	Если Объект.ОтбиратьТабельПоОрганизации Тогда
		ЗАпрос.УстановитьПараметр("Организация",Объект.Организация);	
	КонецЕсли;
	ЗАпрос.УстановитьПараметр("СпСотрудников",СпСотрудников);
	
	ЗАпрос.УстановитьПараметр("НачПериода",НачалоДня(НачалоМесяца(Объект.Дата)));
	ЗАпрос.УстановитьПараметр("КонПериода",КонецДня(КонецМесяца(Объект.Дата)));
	Объект.Распределение.Очистить();
	
	ВЫборкаСотр = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВЫборкаСотр.Следующий() Цикл
		ВыборкаПодр = ВЫборкаСотр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВсегоОтработано =   ВЫборкаСотр.ОтработаноЧасов;
		СтрокаСотрудник = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник",ВЫборкаСотр.Сотрудник)); 
		
		//НужноРаспределить = СтрокаСотрудник[0].СуммаНачисления+СтрокаСотрудник[0].СуммаФОТ;
		
		УжеРаспределилиСуммаНачисления = 0;
		УжеРаспределилиСуммаФОТ= 0;
		УжеРаспределилиСуммаНалогов= 0;
		
		Пока ВыборкаПодр.Следующий() Цикл
			нСТр =   Объект.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств(нСТр,ВыборкаПодр);  
			Если Не ЗначениеЗаполнено(Нстр.Направление) Тогда  
				  Нстр.Направление = Нстр.Сотрудник.ОсновноеНаправление;
			КонецЕсли;
			Если ВсегоОтработано > 0 Тогда
				нСТр.СуммаНачисления= Окр(СтрокаСотрудник[0].СуммаНачисления*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				//нСТр.СуммаФОТ= Окр(СтрокаСотрудник[0].СуммаФОТ*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				//нСТр.СуммаНалогов= Окр(СтрокаСотрудник[0].СуммаНалогов*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				
				УжеРаспределилиСуммаНачисления=УжеРаспределилиСуммаНачисления+   нСТр.СуммаНачисления;
				//УжеРаспределилиСуммаФОТ=УжеРаспределилиСуммаФОТ+   нСТр.СуммаФОТ;
				//УжеРаспределилиСуммаНалогов=УжеРаспределилиСуммаНалогов+   нСТр.СуммаНалогов;
			ИНаче
				//Вся сумма на 1 строку
				Если ВыборкаПодр.Количество()=1 Тогда
					нСТр.СуммаНачисления= СтрокаСотрудник[0].СуммаНачисления;
					//нСТр.СуммаФОТ= СтрокаСотрудник[0].СуммаФОТ;
					//нСТр.СуммаНалогов= СтрокаСотрудник[0].СуммаНалогов;
					
					
					УжеРаспределилиСуммаНачисления=УжеРаспределилиСуммаНачисления+   нСТр.СуммаНачисления;
					//УжеРаспределилиСуммаФОТ=УжеРаспределилиСуммаФОТ+   нСТр.СуммаФОТ;
					//УжеРаспределилиСуммаНалогов=УжеРаспределилиСуммаНалогов+   нСТр.СуммаНалогов;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаСотрудник[0].СуммаНачисления-УжеРаспределилиСуммаНачисления<>0 Тогда
			нСТр.СуммаНачисления=нСТр.СуммаНачисления+СтрокаСотрудник[0].СуммаНачисления-УжеРаспределилиСуммаНачисления;
		КонецЕсли;
		
		//Если СтрокаСотрудник[0].СуммаФОТ-УжеРаспределилиСуммаФОТ<>0 Тогда
		//	нСТр.СуммаФОТ=нСТр.СуммаФОТ+СтрокаСотрудник[0].СуммаФОТ-УжеРаспределилиСуммаФОТ;
		//КонецЕсли;

		//Если СтрокаСотрудник[0].СуммаНалогов-УжеРаспределилиСуммаНалогов<>0 Тогда
		//	нСТр.СуммаНалогов=нСТр.СуммаНалогов+СтрокаСотрудник[0].СуммаНалогов-УжеРаспределилиСуммаНалогов;
		//КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры
